Revit 2027 API
InternalDefinition.Name Property
The user-visible name for the parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public override string Name { get; }
Public Overrides ReadOnly Property Name As String
	Get
public:
virtual property String^ Name {
	String^ get () override;
}
abstract Name : string with get
override Name : string with get
Property Value
String
See Also
Reference
InternalDefinition Class
Autodesk.Revit.DB Namespace